Revit 2027 API
AnalysisDisplayColorSettings.ColorSettingsType Property
 Stores type of color settings
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayStyleColorSettingsType ColorSettingsType { get; set; }
Public Property ColorSettingsType As AnalysisDisplayStyleColorSettingsType
	Get
	Set
public:
property AnalysisDisplayStyleColorSettingsType ColorSettingsType {
	AnalysisDisplayStyleColorSettingsType get ();
	void set (AnalysisDisplayStyleColorSettingsType value);
}
member ColorSettingsType : AnalysisDisplayStyleColorSettingsType with get, set
Property Value
AnalysisDisplayStyleColorSettingsType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace